Revit 2027 API
MEPNetworkSegmentData.VelocityPressure Property
 The calculated velocity pressure of this segment, in kg/(ft*s^2).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double VelocityPressure { get; }
Public ReadOnly Property VelocityPressure As Double
	Get
public:
property double VelocityPressure {
	double get ();
}
member VelocityPressure : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace